Repository: chesio/woocommerce-wcp
Catalog: woocommerce-wirecard-checkout-page/languages/woocommerce-wcp-*.po
Languages: de_de

source: Wirecard CEE is a popular payment service provider (PSP) and has connections with over 20 national and international currencies.
de_de: Wirecard CEE Österreichs marktführender Payment-Service-Provider (PSP) und hat Anbindungen an über 20 nationale und internationale Zahlungsmittel.Wirecard CEE ist Teil des Wirecard-Konzerns und Kompetenzzentrum für Österreich und die CEE-Märkte (Central and Eastern Europe).

source: Enable/Disable
de_de: Aktiviern/Deaktivieren

source: Enable Wirecard Checkout Page
de_de: Wirecard Checkout Page aktivieren

source: Title
de_de: Titel

source: This controls the title which the user sees during checkout.
de_de: Legt den Titel fest, den der Kunde während des Checkout sieht.

source: Description
de_de: Beschreibung

source: This controls the description which the user sees during checkout.
de_de: Legt die Beschreibung fest, die der Kunde während des Checkout sieht.

source: Pay via Wirecard Checkout Page
de_de: Bezahlung via Wirecard Checkout Page

source: Debug Log
de_de: Protokolldatei

source: Log Wirecard Checkout Page events.
de_de: Wirecard Checkout Page Ereignisse werden in eine Logdatei geschrieben.

source: Customer Id
de_de: Kundennummer

source: Wirecard CEE Customer Id.
de_de: Wirecard CEE Kundennummer

source: Wirecard CEE Secret.
de_de: Preshared Key zur Signierung der übertragenen Parameter

source: Backlink on the Wirecard Checkout Page to your shop, usualy links to contact or imprint page.
de_de: URL Ihrer Kontakt-/Impressumsseite.

source: Image Url
de_de: Bild Url

source: Image Url for displaying an image on the Wirecard Checkout Page (95x65 pixels preferred).
de_de: Url zu Ihrem Logo auf der Bezahlseite (vorzugsweise 95x65 Pixel).

source: Max. retries
de_de: Max. Versuche

source: Maximal number of payment retries.
de_de: Anzahl der maximalen Zahlungsversuche.

source: Enable auto deposit
de_de: Autom. abbuchen

source: Auto deposit.
de_de: Automatisches Abbuchen der Zahlung.

source: Send additional data
de_de: Detaillierte Kundendaten senden

source: Send additional customer information.
de_de: Detaillierte Kundendaten senden

source: Use Iframe
de_de: IFrame verwenden

source: Use Iframe.
de_de: Bezahlfenster wird in einem Iframe geöffnet.

source: Display text
de_de: Text auf der Bezahlseite

source: Display Text on the Wirecard Checkout Page.
de_de: Text, der dem Kunden zu den Bestelldaten angezeigt wird

source: Payment is choosen on the Wirecard Checkout Page.
de_de: Die Zahlungsart wird auf der Wirecard Checkout Page ausgewählt.

source: Credit Card.
de_de: Kredikartenzahlung.

source: Credit Card mobile-, tele-order.
de_de: Kredikartenzahlung Mobil-, Tele-Order

source: eps Online Bank Transfer.
de_de: eps Online-Überweisung.

source: SOFORT banking (PIN/TAN)
de_de: SOFORT Überweisung (PIN/TAN)

source: SOFORT banking (PIN/TAN).
de_de: SOFORT Überweisung (PIN/TAN).

source: Mobile Phone Invoicing.
de_de: Bezahlung am Handy via paybox

source: Direct Debit.
de_de: Lastschriftverfahren.

source: Invoice.
de_de: Kauf auf Rechnung.

source: Installment
de_de: Ratenzahlung

source: Installment.
de_de: Ratenzahlung.

source: Invoice minimum amount
de_de: Min. Bestellsumme für Rechnung

source: Invoice minimum amount.
de_de: Min. Bestellsumme für Rechnung.

source: Invoice maximum amount
de_de: Max. Bestellsumme für Rechnung

source: Invoice maximum amount.
de_de: Max. Bestellsumme für Rechnung.

source: Installment minimum amount
de_de: Min. Bestellsumme für Ratenzahlung.

source: Installment minimum amount.
de_de: Min. Bestellsumme für Ratenzahlung.

source: Installment maximum amount
de_de: Max. Bestellsumme für Ratenzahlung

source: Installment maximum amount.
de_de: Max. Bestellsumme für Ratenzahlung.

source: Payment type is not available, please select another payment type.
de_de: Die ausgewählte Zahlungsart ist nicht verfügbar, bitte wählen Sie eine andere aus.

source: Please fill out the birthday field.
de_de: Bitte füllen Sie das Geburtstagsfeld aus.

source: Birthday field is invalid.
de_de: Der Geburtstag ist ungültig.

source: You are not allowed to use this payment type.
de_de: Diese Zahlungsart ist nicht erlaubt.

source: Starting payment.
de_de: Starte den Bezahlvorgang.

source: Panic: Order-Id missing
de_de: Panik: Order-Id fehlt

source: Payment has been cancelled.
de_de: Der Bezahlvorgang wurde abgebrochen.

source: Payment has failed.
de_de: Der Bezahlvorgang ist fehl geschlagen.

source: Validation error: invalid response
de_de: Fehler bei der Überprüfung: ungültige Antwort

source: Awaiting payment notification from 3rd party.
de_de: Warte auf die Zahlungsbestätigung eines dritten Institutes.

source: Payment cancelled.
de_de: Die Bezahlung wurde abgebrochen.

source: Payment failed.
de_de: Die Bezahlung ist fehlgeschlagen.

source: Your order will be processed, as soon as we get the payment notification from your bank institute
de_de: Ihre Bestellung wir verarbeitet, sobald wir die Bestätigung Ihres Bankinstitutes erhalten haben

source: Birthday
de_de: Geburtstag

source: Credit Card
de_de: Kreditkarte

source: Credit Card MoTo
de_de: Kreditkarte MoTo

source: eps Online Bank Transfer
de_de: eps Online-Überweisung

source: Mobile Phone Invoicing
de_de: Handyabrechnung

source: Direct Debit
de_de: Lastschriftverfahren

source: Invoice
de_de: Zahlung auf Rechnung
